import numpy as np

R1 = 25  # Ом
R2 = 22  # Ом
R3 = 42  # Ом
R4 = 35  # Ом
R5 = 51  # Ом
R6 = 10  # Ом
R7 = 47  # Ом
E1 = 50  # Вольт
E2 = 100 # Вольт


# Матрица коэффициентов A
A = np.array([
    [(1/R1 + 1/(R6) + 1/(R7)), -1/(R1)-1/(R6),0],
    [-1/R1 - 1/R6, (1/R1 + 1/R3 + 1/R4 + 1/R6), -1/R4],
    [0,-1/R4, (1/R2 + 1/R4 + 1/R5)]
])

# Вектор правой части B
B = np.array([
    -E1/R1,
    E1/R1,
    E2/R2
])

# Решение системы уравнений
phi = np.linalg.solve(A, B)

# Вывод решения
print("Решения для φ1, φ2 и φ3:")
print(f"φ1 = {phi[0]:.4f} В")
print(f"φ2 = {phi[1]:.4f} В")
print(f"φ3 = {phi[2]:.4f} В")
